[Timeout] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        this._distribution=new Map();
-        this._last=0;
-        if(!faces || faces<2)
-            this._faces=6;
-        else
-            this._faces=faces;
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 

[Killed] ConditionalExpression
src/Roller.ts:12:22
     constructor(faces: number) {
         this._distribution=new Map();
         this._last=0;
-        if(!faces || faces<2)
+        if(!faces || false)
             this._faces=6;
         else
killedBy: Roller tests Test if the faces sets to default value of 6 if invalid faces is passed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -10

[Killed] LogicalOperator
src/Roller.ts:12:12
     constructor(faces: number) {
         this._distribution=new Map();
         this._last=0;
-        if(!faces || faces<2)
+        if(!faces && faces < 2)
             this._faces=6;
         else
killedBy: Roller tests Test if the faces sets to default value of 6 if invalid faces is passed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -10

[Killed] BlockStatement
src/Roller.ts:28:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        if(value<1 || value> this._faces)
-            return 0;
-        let key=value;
-        let val=this._distribution.get(key);
-        if(!val || val==undefined)
-            this._distribution.set(key,1);
-        else    
-            this._distribution.set(key,val);
-        this._last=value;
-        return value;
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller tests Test if the last value is appropriate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] LogicalOperator
src/Roller.ts:29:12
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number{
-        if(value<1 || value> this._faces)
+        if(value < 1 && value > this._faces)
             return 0;
         let key=value;
killedBy: Roller tests Test if the roller returns same value if the roll is appropriate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -50

[Killed] EqualityOperator
src/Roller.ts:29:23
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number{
-        if(value<1 || value> this._faces)
+        if(value<1 || value <= this._faces)
             return 0;
         let key=value;
killedBy: Roller tests Test if the last value is appropriate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[NoCoverage] EqualityOperator
src/Roller.ts:33:20
             return 0;
         let key=value;
         let val=this._distribution.get(key);
-        if(!val || val==undefined)
+        if(!val || val != undefined)
             this._distribution.set(key,1);
         else    

[NoCoverage] ConditionalExpression
src/Roller.ts:33:20
             return 0;
         let key=value;
         let val=this._distribution.get(key);
-        if(!val || val==undefined)
+        if(!val || false)
             this._distribution.set(key,1);
         else    

[Killed] BlockStatement
src/Roller.ts:46:22
     last(): number {
         return this._last;
     }
-    getFaces():number{
-        return this._faces;
-    }
+    getFaces():number{}
 
     // returns a Map that represents the current distribution of rolls for each
killedBy: Roller tests Test if the appropriate number of faces has been set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined
